In [1]:
import pandas as pd
import numpy as np

In [25]:
 #1  data = {
    'Name': ['Alice', 'Bob', 'Charlie'], 
    'Age': [25, 30, 35],                
    'City': ['New York', 'Paris', 'London']}

In [31]:
df=pd.DataFrame(data)

In [33]:
print(df)

      Name  Age      City
0    Alice   25  New York
1      Bob   30     Paris
2  Charlie   35    London

In [57]:
  #2 df = pd.read_csv('https://raw.githubusercontent.com/s4sauravv/Datasets/main/Advertising.csv')

In [60]:
print(df)

     Unnamed: 0     TV  radio  newspaper  sales
0             1  230.1   37.8       69.2   22.1
1             2   44.5   39.3       45.1   10.4
2             3   17.2   45.9       69.3    9.3
3             4  151.5   41.3       58.5   18.5
4             5  180.8   10.8       58.4   12.9
..          ...    ...    ...        ...    ...
195         196   38.2    3.7       13.8    7.6
196         197   94.2    4.9        8.1    9.7
197         198  177.0    9.3        6.4   12.8
198         199  283.6   42.0       66.2   25.5
199         200  232.1    8.6        8.7   13.4

[200 rows x 5 columns]

In [ ]:
# Here the path of the .csv file is uploaded with dataframe and panda .

In [90]:
  # 3 data = {
    'Name': ['Alice', 'Bob', 'Charlie'], 
    'Age': [25, 30, 35],                
    'City': ['New York', 'Paris', 'London']}

In [92]:
df=pd.DataFrame(data)

In [98]:
print(df)

      Name  Age      City
0    Alice   25  New York
1      Bob   30     Paris
2  Charlie   35    London

In [17]:
import pandas as pd
import numpy as np

In [ ]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'], 
    'Age': [25, 30, 35],                
    'City': ['New York', 'Paris', 'London']}

In [20]:
df=pd.DataFrame(data)

In [22]:
 #5  print(df.shape)

(3, 3)

In [ ]:
# Shape is used to find the number of rows and colums in a dataset.

In [24]:
  # 7 df['Country']='USA'

In [26]:
df

      Name  Age      City Country
0    Alice   25  New York     USA
1      Bob   30     Paris     USA
2  Charlie   35    London     USA

In [28]:
 #8 del df['City']

In [30]:
df

      Name  Age Country
0    Alice   25     USA
1      Bob   30     USA
2  Charlie   35     USA

In [59]:
import pandas as pd
import numpy as np

In [61]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'], 
    'Age': [25, 30, 35],                
    'City': ['New York', 'Paris', 'London']}

In [63]:
 # 12 df['Age_Group'] = np.where(df['Age'] <= 30, 'Young', 'Old')
print(df)

      Name  Age      City Age_Group
0    Alice   25  New York     Young
1      Bob   30     Paris     Young
2  Charlie   35    London       Old
3    David   40     Tokyo       Old

In [67]:
 # 14 df['Age'].mean()

32.5

In [69]:
df['Age'].median()

32.5

In [71]:
df['Age'].std()

6.454972243679028

In [73]:
  # 15 df['City'].unique()

array(['New York', 'Paris', 'London', 'Tokyo'], dtype=object)

In [81]:
df['City'].count()

4